#include<iostream>
using namespace std;
// Функцийн параметерт утга дамжуулах. 
// параметерт шинээр 8 байт санах ой үүсгээд 
// аргументын утгыг гарааны утга болгоно
void increment(double x) { 
    x++; 
    // функцийн дотор x=11 болно
    // функцийн үйлчлэх хүрээ дуусах үед x хувьсагчийн санах ой чөлөөлөгдөнө
}

// Функцийн параметерт хаягаар дамжуулах
// Параметерт зөвхөн хяган хувьсагчийн хэмжээгээр буюу 
// тогтмол 4 эсвэл 8 байт санах ой нөөцөлснөөр ой хэмнэнэ.
void decrease(double *x) { 
    cout<<x; // 0x002133423 => a буюу хувьсагчийн санах ойн хаягийг хэвэлнэ
    cout<<*x; // *0x002133423 => 10 буюу хувьсагчийн утгыг хэвэлнэ
    (*x)--;//*0x002133423 => 9 болгоно буюу a хувьсагчийн утгыг 9 болгоно
    // функцийн үйлчлэх хүрээ дуусах үед x буюу параметерт үүссэн хаяган хувьсагчийн санах ой чөлөөлөгдөнө
    // гэхдээ a хувьсагчийн утга 9 хэвээр үлдэнэ
} 

// Функцийн параметерт заалтаар дамжуулах
// Параметерт заалт ирэх учир санах ой нөөцлөхгүй, ой хэмнэнэ.
void multiply(double &x) { 
    // x гэдэг параметр нь a хувьсагчийн өөр нэг нэр болно
    x=x*10; 
    // функцийн үйлчлэх хүрээ дуусах үед x хувьсагчийн санах ой чөлөөлөгдөхгүй
    // a хувьсагчийн утга 90 хэвээр үлдэнэ
}

main(){
    // хувьсагч зарлах үед 8 байт санах ой нөөцөлнө, 10 гэдэг гарааны утга онооно
    double a = 10; 

    // increment(10) буюу функцийн параметрт 10 утга дамжина. 
    // Энэ нь параметрт шинээр үүссэн санах ойд хуулбарлагдана
    increment(a);  
    cout<<a; // Функц дуудагдсны дараа a хувьсагчийн утга хэвээр 10 байна

    // decrease(0x002133423) буюу функцийн параметрт a хувьсагчийн санах ойн хаяг дамжина
    // Энэ нь параметрт үүссэн хаяган хувьсагчид хуулбарлагдана
    decrease(&a); 
    cout<<a; // Функц дуудагдсны дараа a хувьсагчийн утга 9 болно

    // multiply(a) буюу функцийн параметрт a хувьсагчийн өөр нэг нэр дамжина. 
    // Энэ нь параметрт үүссэн заалтанд хуулбарлагдана => multiply(double &x=a)
    multiply(a);  
    cout<<a; // Функц дуудагдсны дараа a хувьсагчийн утга 90 болно
}
